[
  {
    "College": " Dr. T. Thimmaiah Institute of Technology - [DRTTIT], Kolar",
    "Reviews": {
      "Course Curriculum": "Before I was not interested in that course after joining I love to study Civil engineering, civil engineering is Father of all the branches, Civil engineering subjects can understand very easily why because we can learn from seeing the examples around the world.",
      "About faculty": "Our HOD is PhD holder and his knowledge about civil engineering is enormous and his teaching skill was good and understandable and remaining all the faculty's are Mtech holders and they were having 4 to 5 years of experi... ",
      "Campus Life": "The campus environment was so good and clean and its full of green and In our college 6 branches are there and for all the branches they have enough rooms for teaching and in our college labs are very good and all the equipments and systems are enough for all the branch students.\r\nIn our college, there is a big library with all the books and we were having a digital library to acquire good knowledge.\r\nIn our college, they have initiated a group called STREAM and  GO GREEN.\r\nEvery year in our col... ",
      "Scholarship": "Fees structure every year My government Fees was Rs 3900 and college development fees was Rs19100 totally they used to collect 23000 from me and every year I got a scholarship of Rs 17000 and I used to stay in the college hostel. Including hostel and mess, they used to Collect Rs 55000 per year.\r\nActually, I got a job through campus in Dalmia cement but I didn't join because of some other reason they offered me an 18k per month. ",
      "Placement": ""
    },
    "id": "241268d9"
  },
  {
    "College": " Gayatri Vidya Parishad College for Degree and PG Courses, School of Engineering, Visakhapatnam",
    "Reviews": {
      "Course Curriculum": "",
      "About faculty": "",
      "Campus Life": "Our college conducts technical fests every year. \r\nThis year Feb we had Hogwarts named fest. We had so many workshops like AI, Machine learning.\r\nHere we have a library containing various books which are useful for us.\r\nComing to sports, they conduct sports day annually encouraging us in every aspect.\r\nWe have so many clubs represented by students.",
      "Scholarship": "",
      "Placement": "Students from 3rd year are eligible for campus placements. Top recruiting companies like Wipro, TCS, Tech Mahindra and many more have visited our college for placements. There were many offers made by companies. The highest salary package is 20lpa and average salary package offered is 7 LPA. About 80% of the students from college courses got. Course Curriculum -I'm interested in learning more about electronics and communication and their core subjects.\r\nThe faculty take good care of each and every student. They guide us to excel in our subjects as well as technically. The courses conducted by our College is very useful for our internships or startups. "
    },
    "id": "f6547f7a"
  },
  {
    "College": " University of Engineering and Management - [UEM], Kolkata",
    "Reviews": {
      "About faculty": "",
      "Scholarship": "",
      "Course Curriculum ": "My course is a cse. It is on demanded section nowadays a huge number of jobs created every year on several companies.in our college, the faculties are very friendly to all of our students. In every class the faculty: student ratio is 1:75.everyone of them from it, nits.",
      "Placement": "In uem mist of the students are eligible for their placement exam after 6th semester. The average package is around 4- 5 lacks every year. In 2018 the highest package was 40 lacks from Adobe, and in 2019 the highest package was 12 lacks and 2020 placement is going on. ",
      "Campus Life": "So many fests happen in uem. after our even sem exams and our college arrange a \"maker fair festival\" every year, where we have to prepare a project and the best one is selected by faculty members for the festival.it is a great fair for engineering students. "
    },
    "id": "30e47112"
  },
  {
    "College": " Prince Shri Venkateshwara Padmavathy Engineering College - [PSVPEC], Chennai",
    "Reviews": {
      "About faculty": "",
      "Scholarship": "",
      "Placement": "",
      "Campus Life": "I get together party will be on the 2nd of August. The farewell fest will be in February. Novela and cover stories and inspirational stories are available in the library. Using our ID Card we can borrow any or more than one book from the library with a deadline of 1 week for return. Placement -Only 7th and 8th-semester students with nil arrears or 1 arrear are eligible for campuses. The campuses are L & T, TCS,\r\nASPIRE SYSTEMS, Valued labs, Zoho, Byjus, Vembu technologies, Wipro etc. Zoho is the highest-profile packages with difficult tasks and levels. ",
      "Course Curriculum": "We have journal-level activities. Free to join in on any activity. No restriction of any place in our college. Free to speak with our college staff. Good experienced staffs and coordinators. Well experienced associators. "
    },
    "id": "aff664bf"
  },
  {
    "College": " Ramrao Adik Institute of Technology - [RAIT], Navi Mumbai",
    "Reviews": {
      "About faculty": "",
      "Scholarship": "",
      "Campus Life": "It is a great platform to showcase your talent, whether it is related to technology or fine arts. There are about 15 councils in the college, which organize events and workshops like tech fests, technical workshops, dance, music, fine arts, drama, play, sports and whatnot. Right at the top of these councils is the Student Union Council, or abbreviated as SUC. It is the apex student body of the college. The SUC is the body to go-to for any grievances. It also organizes the annual cultural fest... ",
      "Course Curriculum": "-1.  The most important reason for choosing Electronics branch because it provides me with freedom. the freedom to drift between the hardware field and software field.\r\n2. Teacher students ratio is kept to maintain a better quality of education, better understanding, better teaching. It is maintained to keep teacher and learner active. If the ideal ratio is kept, it becomes easy for a teacher to give the better result and to give better attention to the students.\r\n3. All the teachers are very hel...",
      "Placement": "-1.Students become eligible for campus placements from sem 6 if you are not having any backlogs.\r\n2.TCS, Wipro, Tech Mahindra, JP Morgan, Morgan Stanley, BYJUS, L&T Infotech and many more MNC companies visited the campus.\r\n3.The highest package offered was 15lap and the average package that students get is 3.0 LPA.\r\n4.The percentage of students getting placed from campus is 90%\r\n5.Getting a job in a reputed organization where I can utilize my skills for the betterment of the organization."
    },
    "id": "17c2a451"
  },
  {
    "College": "Lovely Professional University - [LPU], Jalandhar",
    "Reviews": {
      "About faculty": "",
      "Campus Life": "",
      "Scholarship": "",
      "Course Curriculum": "-I prefer this course because I found it more interesting. The student ratio is the best. Teaching method of the faculties are best everyone can understand the lecture by attending it once only. After every lecture, there is doubt session for 10 minutes to clear the doubt of every student. Campus Life -The annual fest happens every year for students. Various cultural and sports activities happened in that. There is a huge collection of varieties of books in the library offered by the college. And the best part is the digital library is also provided by the college for every student. ",
      "Placement": " -I have got eligible after qualifying the 7th semester for campus placements. Various MNC offers the best package for every students. Most of the students of every batch got placed with high package. And various Indian companies also offer the best package including accommodation. "
    },
    "id": "69b7547f"
  },
  {
    "College": "fffff",
    "Reviews": {
      "Course Curriculum": "rerrrrrrrrrrrrr",
      "About faculty": "rrrrrrrrrrrrrrrrr",
      "Campus Life": "rrrrrrrrrrrrrrrrrrrrrr",
      "Scholarship": "rrrrrrrrrrrrrrrrrr",
      "Placement": "rrrrrrrrrrrrrrrrr"
    },
    "submitter": "ffdf",
    "id": "1fcc0467"
  },
  {
    "College": "fffff",
    "Reviews": {
      "Course Curriculum": "h",
      "About faculty": "h",
      "Campus Life": "hh",
      "Scholarship": "hh",
      "Placement": "hh"
    },
    "submitter": "ffdf",
    "id": "135c2f05"
  }
]