[
  {
    "College": " Dr. T. Thimmaiah Institute of Technology - [DRTTIT], Kolar",
    "Reviews": "Course Curriculum -Before I was not interested in that course after joining I love to study Civil engineering, civil engineering is Father of all the branches, Civil engineering subjects can understand very easily why because we can learn from seeing the examples around the world.\r\nAbout faculty - Our HOD is PhD holder and his knowledge about civil engineering is enormous and his teaching skill was good and understandable and remaining all the faculty's are Mtech holders and they were having 4 to 5 years of experi... Campus Life -The campus environment was so good and clean and its full of green and In our college 6 branches are there and for all the branches they have enough rooms for teaching and in our college labs are very good and all the equipments and systems are enough for all the branch students.\r\nIn our college, there is a big library with all the books and we were having a digital library to acquire good knowledge.\r\nIn our college, they have initiated a group called STREAM and  GO GREEN.\r\nEvery year in our col... Scholarship -Fees structure every year My government Fees was Rs 3900 and college development fees was Rs19100 totally they used to collect 23000 from me and every year I got a scholarship of Rs 17000 and I used to stay in the college hostel. Including hostel and mess, they used to Collect Rs 55000 per year.\r\nActually, I got a job through campus in Dalmia cement but I didn't join because of some other reason they offered me an 18k per month. ",
    "id": "241268d9"
  },
  {
    "College": " Gayatri Vidya Parishad College for Degree and PG Courses, School of Engineering, Visakhapatnam",
    "Reviews": "Campus Life -Our college conducts technical fests every year. \r\nThis year Feb we had Hogwarts named fest. We had so many workshops like AI, Machine learning.\r\nHere we have a library containing various books which are useful for us.\r\nComing to sports, they conduct sports day annually encouraging us in every aspect.\r\nWe have so many clubs represented by students. Placement -Students from 3rd year are eligible for campus placements. Top recruiting companies like Wipro, TCS, Tech Mahindra and many more have visited our college for placements. There were many offers made by companies. The highest salary package is 20lpa and average salary package offered is 7 LPA. About 80% of the students from college courses got. Course Curriculum -I'm interested in learning more about electronics and communication and their core subjects.\r\nThe faculty take good care of each and every student. They guide us to excel in our subjects as well as technically. The courses conducted by our College is very useful for our internships or startups. ",
    "id": "f6547f7a"
  },
  {
    "College": " University of Engineering and Management - [UEM], Kolkata",
    "Reviews": "Course Curriculum -My course is a cse. It is on demanded section nowadays a huge number of jobs created every year on several companies.in our college, the faculties are very friendly to all of our students. In every class the faculty: student ratio is 1:75.everyone of them from it, nits. Placement -In uem mist of the students are eligible for their placement exam after 6th semester. The average package is around 4- 5 lacks every year. In 2018 the highest package was 40 lacks from Adobe, and in 2019 the highest package was 12 lacks and 2020 placement is going on. Campus Life -So many fests happen in uem. after our even sem exams and our college arrange a \"maker fair festival\" every year, where we have to prepare a project and the best one is selected by faculty members for the festival.it is a great fair for engineering students. ",
    "id": "30e47112"
  },
  {
    "College": " Prince Shri Venkateshwara Padmavathy Engineering College - [PSVPEC], Chennai",
    "Reviews": "Campus Life -I get together party will be on the 2nd of August. The farewell fest will be in February. Novela and cover stories and inspirational stories are available in the library. Using our ID Card we can borrow any or more than one book from the library with a deadline of 1 week for return. Placement -Only 7th and 8th-semester students with nil arrears or 1 arrear are eligible for campuses. The campuses are L & T, TCS,\r\nASPIRE SYSTEMS, Valued labs, Zoho, Byjus, Vembu technologies, Wipro etc. Zoho is the highest-profile packages with difficult tasks and levels. Course Curriculum -We have journal-level activities. Free to join in on any activity. No restriction of any place in our college. Free to speak with our college staff. Good experienced staffs and coordinators. Well experienced associators. ",
    "id": "aff664bf"
  },
  {
    "College": " Ramrao Adik Institute of Technology - [RAIT], Navi Mumbai",
    "Reviews": "Campus Life -1. It is a great platform to showcase your talent, whether it is related to technology or fine arts. There are about 15 councils in the college, which organize events and workshops like tech fests, technical workshops, dance, music, fine arts, drama, play, sports and whatnot. Right at the top of these councils is the Student Union Council, or abbreviated as SUC. It is the apex student body of the college. The SUC is the body to go-to for any grievances. It also organizes the annual cultural fest... Course Curriculum -1.  The most important reason for choosing Electronics branch because it provides me with freedom. the freedom to drift between the hardware field and software field.\r\n2. Teacher students ratio is kept to maintain a better quality of education, better understanding, better teaching. It is maintained to keep teacher and learner active. If the ideal ratio is kept, it becomes easy for a teacher to give the better result and to give better attention to the students.\r\n3. All the teachers are very hel... Placement -1.Students become eligible for campus placements from sem 6 if you are not having any backlogs.\r\n2.TCS, Wipro, Tech Mahindra, JP Morgan, Morgan Stanley, BYJUS, L&T Infotech and many more MNC companies visited the campus.\r\n3.The highest package offered was 15lap and the average package that students get is 3.0 LPA.\r\n4.The percentage of students getting placed from campus is 90%\r\n5.Getting a job in a reputed organization where I can utilize my skills for the betterment of the organization. ",
    "id": "17c2a451"
  },
  {
    "College": " Lovely Professional University - [LPU], Jalandhar",
    "Reviews": "Course Curriculum -I prefer this course because I found it more interesting. The student ratio is the best. Teaching method of the faculties are best everyone can understand the lecture by attending it once only. After every lecture, there is doubt session for 10 minutes to clear the doubt of every student. Campus Life -The annual fest happens every year for students. Various cultural and sports activities happened in that. There is a huge collection of varieties of books in the library offered by the college. And the best part is the digital library is also provided by the college for every student. Placement -I have got eligible after qualifying the 7th semester for campus placements. Various MNC offers the best package for every students. Most of the students of every batch got placed with high package. And various Indian companies also offer the best package including accommodation. ",
    "id": "69b7547f"
  },
  {
    "College": " Maharaja Agrasen Institute of Technology - [MAIT], New Delhi",
    "Reviews": "Campus Life -They have possible every lab in our campus whether it is technical, management, the moot court for law students, a smart class for architecture ones, chemistry lab for pharmacy students, and workshop for engineering dept. They organise several extracurricular activities on regular basis. They also organise the sports meet every year and have several courts and ground on the campus itself. Scholarship -Fee Structure is almost the same for all branches i.e Around 1.31 Lakh per year.\r\nScholarship opportunities are available for qualified and deserving students. You'll get to know about that by respective Faculties. Jobs are also available good placement as compared to other IP University. Course Curriculum -Faculty for the respective courses are well experienced and have very good knowledge in their fields. The lab attendants are also well experienced from the companies itself. Librarian, technician, attendants all are very helping and cooperative. ",
    "id": "1d96ee51"
  },
  {
    "College": " Satya Group of Institutions - [SGI], Faridabad",
    "Reviews": "Course Curriculum -Engineering is a difficult course if we include all the aspects. The fee is higher than many other courses and the subjects are more difficult to study and understand. However, if one manages to understand the nature of the subjects, the course and the exams, one can clear this course and become an engineer on time without any backlogs. Faculty members are supportive and will also provide you with notes sometimes without asking them to do so but sometimes when asked. But the fact to be noted is ... Campus Life -Nice infrastructure, good hostel amenities with good classrooms in the college buildings. Classrooms are large air-conditioned rooms with proper ventilation. One would find all the necessary books one needs to study for the exams in the library's books' collection. Fresher's parties, tech fests, farewell parties are conducted frequently from time to time. Annual sports fests are also conducted regularly. Placement -Students become eligible for campus placements 7th semester onwards. Campus drives organised by the college invites many major brands for the students to choose from. Companies like HCL, Infosys, Midas group usually visit the college for recruitment purposes. The college management tries its level best to get a 100% of students placed subject to the requirements of the recruiters. ",
    "id": "81f269b0"
  },
  {
    "College": " Greater Noida Institute of Technology (Engineering Institute), Greater Noida",
    "Reviews": "Campus Life -There are alumni meet, intercollege and Intra college sports as well as cultural activities. In GNIOT there is a huge collection of latest books which enhance our knowledge. Here we enjoy various clubs like - sports club, cultural club, Photography club etc. Course Curriculum -I chose Information Technology as I wanted to become a successful and well-settled software engineer and I was got to know that this college is best to fulfil my dreams. The faculties are well experienced, doctorate and above all cooperative. Placement -In the last sems of the course, the student is eligible for the placement. More than 250 companies came for the placement like - TCS, IBM, Lenovo, Oppo, Microsoft etc. Approx 90% of students got the placement of my batch. ",
    "id": "2af9fc3b"
  },
  {
    "College": " Rishi M.S Institute of Engineering & Technology for Women - [RITW], Hyderabad",
    "Reviews": "Internship -I am a first-year student. The internship starts in my first year at my college. As a campus ambassador and as a content writer I am working right now. As a content writer, they ask me to write an article about a given topic. We can receive a stipend for our excellent performance Course Curriculum -I wanted to join in cse group. faculty was good and they are teaching very well they are friendly with us. We can ask them any doubts. They are well experienced in teaching. We have two-semester exams. If we go through all lessons we can get a very good score Scholarship -If we get seats through Telangana eamcet examination fees structure is 60,000 per student. We should pay fees to jntu for the semester examination. there is no separate lab fees or library fees. we should pay for placements training ",
    "id": "be9a32f2"
  },
  {
    "College": " Jabalpur Engineering College - [JEC], Jabalpur",
    "Reviews": "Campus Life -Every year the various annual fest is organized in Jabalpur Engineering College such as Aureole which is held at a very grand stage. Sports and Technical fest are also organized every year during October month. There is a nice collection of books in the JEC library but it's the only drawback is that it's only open till 5 pm. The classroom here is very old and the infrastructure is not very good. Sports and other extracurricular activities are available here. There are lots of club in JEC like Ra... Course Curriculum -The main reason for choosing electrical engineering was because mainly I wanted to try for government job and some competitive exams. Faculty here are very trained and with their knowledge, they have moulded student in getting their dream jobs and helped them in cracking highly competitive exams. Student-Teacher ratio is 1:60 here. Most of the faculty in JEC is the PhD holder and have very vast knowledge. There were two mid-sems and one main exam in a semester. Scholarship -The best thing about JEC is the college fees is very less as compared to other colleges in MP for 1 year College fees was around 26500 which is very less as compared to other colleges in MP. There is a various scholarship for students from economically weak background students like scholarship for OBC, SC and ST students. And other scholarship schemes like Medhavi Yojayana. ",
    "id": "a3905e3b"
  },
  {
    "College": " Don Bosco Institute of Technology - [DBIT], Mumbai",
    "Reviews": "Scholarship -The tuition fees are around 96000 the total comes around 109550, the college also has library fees of 400. College does provide good assistance with scholarship procedure. There are three types of scholarships that you can avail. \r\nFor the Economically backward class - 50%\r\n Minority - 25000 Rs\r\n OBC - i dont know the amount of scholarship for obc. Internship -College does have a two week internship programme for Refrigeration & Air Conditioning and Automobiles. I opted for RAC internship. In that, we were trained in college for a week and then we went with an AC servicing company for getting hands on experience. The name of the company was Weather control engineers. Campus Life -The crowd at the college is decent. Campus has a football ground, a basketball court, a volleyball court so sports activities are pretty much good. Infrastructure is moderate not very high-fi but is spacious. There many clubs in college for automobile, RAC, dance, music, literature, social service. ",
    "id": "ddcbfeb8"
  },
  {
    "College": " IMS Engineering College - [IMSEC], Ghaziabad",
    "Reviews": "Scholarship -Fee Structure is somewhat the same as all other colleges under AKTU. Fees are always kept around approx 1.3 LPA through the course. Apart from that General caste students have a fair chance to grab the opportunity to avail the scholarship. The scholarship scheme is solely intended to the needy ones and completely driven by the state government. Course Curriculum -Course curriculum is all about in accordance of University guidelines (Aktu). No doubt about the faculty's personal qualifications and achievements. But still I think there is somewhat a issue about their teaching techniques. Apart from that all of the departments are reviewed on the basis of their performance, specifically by the students. Placement -Campus placements at IMS Engineering College are quite good. Companies selection for invitation regarding the placements is nice. Several companies came for different department placements respectively. Companies like Amazon, TCS, Wipro, Deloitte, QA Infotech and many others had made IMSEC as a primary choice. ",
    "id": "244af17f"
  },
  {
    "College": " Banasthali Vidyapith, Jaipur",
    "Reviews": "Course Curriculum -21st century has been the century of Technology. We see new innovation every now and then so I wanted to be the part of it. Computer science has been one of the favourite subjects in my 11th and 12th standard as it includes cplusplus coding along with OOPS concept. Because electronics and communication branch is known as the evergreen branch where you get to learn about electronics that coding and many more most the course attracted new. Banasthali Vidyapeeth has a primitive technique of teachin... Scholarship -The fee structure that has been displayed in the brochure in the various domain is 99000 for education and 49000 for hostel fee. From this, there is various other cause that they demand after admission. Only during the admission, I had to pay rupees 170000 which is quite a big amount. We have to pay our fees every semester. Write from second your the cost of the odd semester is around 90000 and for even semester it is around 80000. Apart from this, there are various other courses like technical ... Campus Life -The library here is very large. Almost every department has its own libraries along with the central library that is connected to each and every department of the university. The availability of the journals is quite frequent. There is a concept of V for elective ateez in Anna University which includes every sport including horse riding and other activities like dancing painting etc. In campus, we need to wear khadi and that is quite eco-friendly and convenient for the hot weather of Rajasthan. ",
    "id": "89f8e794"
  },
  {
    "College": " Maharaja Agrasen Institute of Technology - [MAIT], New Delhi",
    "Reviews": "Course Curriculum -Teachers and faculty members are really helpful and Each program is divided into eight semesters to be completed in a minimum of 4 years. In every semester, courses related to the branch are conducted with theory course supplemented with practical work in each subject. Apart from this, every student is required to take up project work and submit the dissertation report to the institute. Scholarship -First-year fees are around 1 lac per year and you need to submit fees in August/September or whenever the session gets started and it remains same for every year and college will also help in providing all the necessary financial assistance to EWS category students. Placement -Placement and Job opportunities are very good. Many companies visit the campus and generally, every student gets placed here through campus recruitment. Infosys and Accenture visit campus every year and Average placement is around 4lac and goes up to 10 lac. ",
    "id": "6b770d5a"
  },
  {
    "College": " Sikkim Manipal Institute of Technology - [SMIT], East Sikkim",
    "Reviews": "Campus Life -It has a big annual cultural and technology fest i.e. KAALRAV and Tech Adrishta respectively. This fest is usually conducted from December to April. The college has many clubs where students can take part after classes like a singing club, dance clubs, debate clubs etc. The college provides with all basic amenities in a hostel, labs, classroom, libraries. The library has a various collection of books one needs. There is a separate sports complex as well. Placement -Around 96% of students get placed. Students become eligible for campus placements from 7th semester. Many high-end companies hire like DELL, shell, Microsoft. Other companies also hire like sony, erricson, wellsfargo, Capgemini etc. highest package received is 18 lakhs per year and the average package is around 4-5 lakhs per year. Course Curriculum -I chose this course in order to pursue software engineering. This course provides with all the demanding topics. The faculty to student ratio is 1:35. Faculty here is highly knowledgable and helpful. The semesters that happen are not difficult to pass and the term exams happen very timely. ",
    "id": "a348e87d"
  },
  {
    "College": " Noida Institute of Engineering and Technology - [NIET], Greater Noida",
    "Reviews": "Course Curriculum -I have opted for electronics and communication engineering because it's a subject of my interest. In my current semester (3rd). We have almost 180 students divided into three sections. And there is a total of 24 faculty members in our ECE department. Most of the professors are postgraduates with their respective MTECH degrees whereas rest others have done their PhD in reputed colleges. In terms of teaching the best part is that most of the professors are very engaging and motivating.  General id... Campus Life -Campus life is awesome. We have few robotic tech fests as well as as many other fests mostly focused on growing technology demands that are organised by the seniors in every semester generally in October (for odd semesters) and in Feb ( for even semesters). There is a library which has availability of all the books regarding particular courses. As of extracurricular activities, there are various club namely culture, arts, music, programing and including sports that is basket ball. The overall en... Placement -Placement for various courses starts from the 6th semester itself. The placement is quite good. The companies that come mainly focus on students with technical and programming skills, but that doesn't mean that only CS and IT students are favoured the most. Doesn't matter from which branch you are if you have the skill then you are eligible for it. The number of students getting placed is above average. The highest package was 30 LPA and lowest was 3.5 LPA for this year. ",
    "id": "a160923b"
  },
  {
    "College": " Government College of Technology - [GCT], Coimbatore",
    "Reviews": "Course Curriculum -The faculties are very experienced and skilled. If we use them in the right way it paved the way for our better future. The faculty: student ratio is 1:60 for Theory classes and 1:10 for practical classes. There was three internals conducted.  It was conducted once after 5 weeks of regular classes. And then again 5 weeks classes and internal and so on. After completing three internals we had to do practical within a week. After that, we have one and a half week holiday for studying purpose. Then... Campus Life -As a GCTian I strongly said, there are no other colleges in TN which give much freedom. There are no more strict rules and regulations but you need to keep good manners that is what all staff expect from us. Many functions are conducted both department wise and the whole college. Samgamam and Muthamizhl vizha are the college function. Department wise function is conducted one per semester by each department. Many extracurricular activities are allowed and there is no restriction for joining. Scholarship -As already mentioned the fee was around 32k for general category students and then if we want a hostel, overall course duration (4 years), it takes around 100 k and then we need to pay exam fees per year it takes 4.5k. And also many scholarships were provided like government scholarship for BC, MBC, SC, ST etc., and then Alumni Association Scholarship, FFE, etc. ",
    "id": "29580779"
  },
  {
    "College": " NBKR Institute of Science and Technology Vidyanagar - [NBKRIST], Nellore",
    "Reviews": "Campus Life -*fest is conducted every month. The names are changed according to year\r\n*All  books are available in the library and journals are also available in the library for better study\r\n*The classroom is very broad and well designed.\r\n*Huge sports ground for playing & attended ing certain programs and events.\r\nLanguage, literature, drawing, painting, etc are so many students who participated in these clubs Placement -*6th,7th,8th students are eligible for the campus placements\r\n*Hcl, Infosys, TCS, etc are the companies are visited, they made so many offers for the students.\r\n* 10 LPA are the highest salary and average salary are 4 lpa had better for the CSE and ECE students are eligible.\r\n*Minimum65% students are eligible for the campus selection.\r\n*I plan to study MBA in abroad. Course Curriculum -* I love the communication system and interested in that very much.\r\n*Faculty are more for teaching the subjects and also students are full in classes.\r\nThe qualification of faculty are PhD,m.tech, graduate completed every teacher.\r\nThere are two term exam s conducted for every year.it is moderate for pass the exam s ",
    "id": "490ccf60"
  },
  {
    "College": " Delhi Technological University - [DTU], New Delhi",
    "Reviews": "Placement -Students are eligible to sit for placement in 4th year. Many good companies come here to recruit. To name a few Adobe, Airtel, TCS, Qualcomm etc. Come here almost every year. Highest package is 1 crore for abroad and around 50 Lakh for India. Scholarship -Fee hike 10% every year and its same for all students of BTech in that particular academic year. Scholarships are available but hard to get. Inhouse scholarship is rarely offered but scholarship from state government is easier to obtain. Campus Life -Engifest is one of the best fest across Delhi. DTU has large area for such fests. There is footfall of aprox 2 lakh on Engifest. Techfest is namesake hardly anyone outside College come. Yuvaan also has decent football. ",
    "id": "c569dbd9"
  }
]